Catalogs/Кандидаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Кандидаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вакансия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вакансии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛичныеДанные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛичныеДанныеКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Comment>АПК:58 Имя не меняется для сохранения совместимости, синоним меняется на более лаконичный</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформацииОКандидатах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резюме</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезюмеТекст</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусИзвлеченияТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИзвлеченияТекстаФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рейтинг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемыйДоход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСогласования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийРешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтклонения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтклоненияКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СреднийРейтинг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресРезюме</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОСебе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьДохода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьОжидаемогоДоходаКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЭтапРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыРаботыСКандидатами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оценки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Оценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/РекрутинговыеСайтыВнутренний/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция ИспользуемыеСайты() Экспорт
	
	ИспользуемыеСайты = Новый Массив();
	
	ИспользуемыеСайты.Добавить(Обработки.ИнтеграцияHeadHunter.Сайт());
	ИспользуемыеСайты.Добавить(Обработки.ИнтеграцияSuperJob.Сайт());
	ИспользуемыеСайты.Добавить(Обработки.ИнтеграцияРаботаРу.Сайт());
	ИспользуемыеСайты.Добавить(Обработки.ИнтеграцияЗарплатаРу.Сайт());
	ИспользуемыеСайты.Добавить(Обработки.ИнтеграцияАвитоРабота.Сайт());
	ИспользуемыеСайты.Добавить(Обработки.ИнтеграцияХабрКарьера.Сайт());
	
	РекрутинговыеСайтыВнутреннийПереопределяемый.ПриОпределенииИспользуемыхСайтов(ИспользуемыеСайты);
	
	Возврат ИспользуемыеСайты;
	
КонецФункции

#Область Интерфейс

#Область ОбязательныеМетоды

Функция НовыйМенеджерСайта(Сайт, Пользователь) Экспорт
	
	МенеджерСайта = Неопределено;
	
	Если Сайт = Обработки.ИнтеграцияHeadHunter.Сайт() Тогда
		МенеджерСайта = Обработки.ИнтеграцияHeadHunter.НовыйМенеджер(Пользователь);
	ИначеЕсли Сайт = Обработки.ИнтеграцияSuperJob.Сайт() Тогда
		МенеджерСайта = Обработки.ИнтеграцияSuperJob.НовыйМенеджер(Пользователь);
	ИначеЕсли Сайт = Обработки.ИнтеграцияРаботаРу.Сайт() Тогда
		МенеджерСайта = Обработки.ИнтеграцияРаботаРу.НовыйМенеджер(Пользователь);
	ИначеЕсли Сайт = Обработки.ИнтеграцияЗарплатаРу.Сайт() Тогда
		МенеджерСайта = Обработки.ИнтеграцияЗарплатаРу.НовыйМенеджер(Пользователь);
	ИначеЕсли Сайт = Обработки.ИнтеграцияАвитоРабота.Сайт() Тогда
		МенеджерСайта = Обработки.ИнтеграцияАвитоРабота.НовыйМенеджер(Пользователь);
	ИначеЕсли Сайт = Обработки.ИнтеграцияХабрКарьера.Сайт() Тогда
		МенеджерСайта = Обработки.ИнтеграцияХабрКарьера.НовыйМенеджер(Пользователь);
	Иначе
		РекрутинговыеСайтыВнутреннийПереопределяемый.ПриПолученииНовогоМенеджераСайта(МенеджерСайта, Сайт, Пользователь);
	КонецЕсли;
	
	Возврат МенеджерСайта;
	
КонецФункции

Процедура ПриЗаполненииАдресовРекрутинговыхСайтов(АдресаСайтов) Экспорт
	
	Обработки.ИнтеграцияHeadHunter.ПриЗаполненииАдресовРекрутинговыхСайтов(АдресаСайтов);
	Обработки.ИнтеграцияSuperJob.ПриЗаполненииАдресовРекрутинговыхСайтов(АдресаСайтов);
	Обработки.ИнтеграцияРаботаРу.ПриЗаполненииАдресовРекрутинговыхСайтов(АдресаСайтов);
	Обработки.ИнтеграцияЗарплатаРу.ПриЗаполненииАдресовРекрутинговыхСайтов(АдресаСайтов);
	Обработки.ИнтеграцияАвитоРабота.ПриЗаполненииАдресовРекрутинговыхСайтов(АдресаСайтов);
	Обработки.ИнтеграцияХабрКарьера.ПриЗаполненииАдресовРекрутинговыхСайтов(АдресаСайтов);
	
	РекрутинговыеСайтыВнутреннийПереопределяемый.ПриЗаполненииАдресовРекрутинговыхСайтов(АдресаСайтов);
	
КонецПроцедуры

Функция ДанныеСайта(Сайт) Экспорт
	
	ДанныеСайта = РекрутинговыеСайтыСлужебный.НовыеДанныеСайта();
	
	Если Сайт = Обработки.ИнтеграцияHeadHunter.Сайт() Тогда
		ДанныеСайта = Обработки.ИнтеграцияHeadHunter.ДанныеСайта();
	ИначеЕсли Сайт = Обработки.ИнтеграцияSuperJob.Сайт() Тогда
		ДанныеСайта = Обработки.ИнтеграцияSuperJob.ДанныеСайта();
	ИначеЕсли Сайт = Обработки.ИнтеграцияРаботаРу.Сайт() Тогда
		ДанныеСайта = Обработки.ИнтеграцияРаботаРу.ДанныеСайта(); 
	ИначеЕсли Сайт = Обработки.ИнтеграцияЗарплатаРу.Сайт() Тогда
		ДанныеСайта = Обработки.ИнтеграцияЗарплатаРу.ДанныеСайта(); 
	ИначеЕсли Сайт = Обработки.ИнтеграцияАвитоРабота.Сайт() Тогда
		ДанныеСайта = Обработки.ИнтеграцияАвитоРабота.ДанныеСайта(); 
	ИначеЕсли Сайт = Обработки.ИнтеграцияХабрКарьера.Сайт() Тогда
		ДанныеСайта = Обработки.ИнтеграцияХабрКарьера.ДанныеСайта(); 
	Иначе
		РекрутинговыеСайтыВнутреннийПереопределяемый.ПриПолученииДанныхСайта(ДанныеСайта, Сайт);
	КонецЕсли;
	
	Возврат ДанныеСайта;
	
КонецФункции

Функция ПроверитьПодключение(Сайт, МенеджерСайта) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыеРеквизитыСайта();
	
	Если Сайт = Обработки.ИнтеграцияHeadHunter.Сайт() Тогда
		Результат = Обработки.ИнтеграцияHeadHunter.ПроверитьПодключение(МенеджерСайта);
	ИначеЕсли Сайт = Обработки.ИнтеграцияSuperJob.Сайт() Тогда
		Результат = Обработки.ИнтеграцияSuperJob.ПроверитьПодключение(МенеджерСайта);
	ИначеЕсли Сайт = Обработки.ИнтеграцияРаботаРу.Сайт() Тогда
		Результат = Обработки.ИнтеграцияРаботаРу.ПроверитьПодключение(МенеджерСайта);
	ИначеЕсли Сайт = Обработки.ИнтеграцияЗарплатаРу.Сайт() Тогда
		Результат = Обработки.ИнтеграцияЗарплатаРу.ПроверитьПодключение(МенеджерСайта);
	ИначеЕсли Сайт = Обработки.ИнтеграцияАвитоРабота.Сайт() Тогда
		Результат = Обработки.ИнтеграцияАвитоРабота.ПроверитьПодключение(МенеджерСайта);
	ИначеЕсли Сайт = Обработки.ИнтеграцияХабрКарьера.Сайт() Тогда
		Результат = Обработки.ИнтеграцияХабрКарьера.ПроверитьПодключение(МенеджерСайта);
	Иначе
		РекрутинговыеСайтыВнутреннийПереопределяемый.ПриПроверкеПодключения(Результат, Сайт, МенеджерСайта);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Подключить(Сайт, МенеджерСайта, ПараметрыПодключения) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыеРеквизитыСайта();
	
	Если Сайт = Обработки.ИнтеграцияHeadHunter.Сайт() Тогда
		Результат = Обработки.ИнтеграцияHeadHunter.Подключить(МенеджерСайта, ПараметрыПодключения);
	ИначеЕсли Сайт = Обработки.ИнтеграцияSuperJob.Сайт() Тогда
		Результат = Обработки.ИнтеграцияSuperJob.Подключить(МенеджерСайта, ПараметрыПодключения);
	ИначеЕсли Сайт = Обработки.ИнтеграцияРаботаРу.Сайт() Тогда
		Результат = Обработки.ИнтеграцияРаботаРу.Подключить(МенеджерСайта, ПараметрыПодключения);
	ИначеЕсли Сайт = Обработки.ИнтеграцияЗарплатаРу.Сайт() Тогда
		Результат = Обработки.ИнтеграцияЗарплатаРу.Подключить(МенеджерСайта, ПараметрыПодключения);
	ИначеЕсли Сайт = Обработки.ИнтеграцияАвитоРабота.Сайт() Тогда
		Результат = Обработки.ИнтеграцияАвитоРабота.Подключить(МенеджерСайта, ПараметрыПодключения);
	ИначеЕсли Сайт = Обработки.ИнтеграцияХабрКарьера.Сайт() Тогда
		Результат = Обработки.ИнтеграцияХабрКарьера.Подключить(МенеджерСайта, ПараметрыПодключения);
	Иначе
		РекрутинговыеСайтыВнутреннийПереопределяемый.ПриПодключении(Результат, Сайт, МенеджерСайта, ПараметрыПодключения);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВакансииССайта(Сайт, МенеджерСайта, БылиОшибки = Ложь) Экспорт
	
	Результат = Неопределено;
	
	Если Сайт = Обработки.ИнтеграцияHeadHunter.Сайт() Тогда
		Результат = Обработки.ИнтеграцияHeadHunter.ВакансииССайта(МенеджерСайта, БылиОшибки);
	ИначеЕсли Сайт = Обработки.ИнтеграцияSuperJob.Сайт() Тогда
		Результат = Обработки.ИнтеграцияSuperJob.ВакансииССайта(МенеджерСайта, БылиОшибки);
	ИначеЕсли Сайт = Обработки.ИнтеграцияРаботаРу.Сайт() Тогда
		Результат = Обработки.ИнтеграцияРаботаРу.ВакансииССайта(МенеджерСайта, БылиОшибки);
	ИначеЕсли Сайт = Обработки.ИнтеграцияЗарплатаРу.Сайт() Тогда
		Результат = Обработки.ИнтеграцияЗарплатаРу.ВакансииССайта(МенеджерСайта, БылиОшибки);
	ИначеЕсли Сайт = Обработки.ИнтеграцияАвитоРабота.Сайт() Тогда
		Результат = Обработки.ИнтеграцияАвитоРабота.ВакансииССайта(МенеджерСайта, БылиОшибки);
	ИначеЕсли Сайт = Обработки.ИнтеграцияХабрКарьера.Сайт() Тогда
		Результат = Обработки.ИнтеграцияХабрКарьера.ВакансииССайта(МенеджерСайта, БылиОшибки);
	Иначе
		РекрутинговыеСайтыВнутреннийПереопределяемый.ПриПолученииВакансийССайта(Результат, Сайт, МенеджерСайта, БылиОшибки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеРеквизитаПубликацииПоУмолчанию(Сайт, МенеджерСайта, Вакансия, Реквизит) Экспорт
	
	Результат = Неопределено;
	
	Если Сайт = Обработки.ИнтеграцияHeadHunter.Сайт() Тогда
		Результат = Обработки.ИнтеграцияHeadHunter.ЗначениеРеквизитаПубликацииПоУмолчанию(
			МенеджерСайта, Вакансия, Реквизит);
	ИначеЕсли Сайт = Обработки.ИнтеграцияSuperJob.Сайт() Тогда
		Результат = Обработки.ИнтеграцияSuperJob.ЗначениеРеквизитаПубликацииПоУмолчанию(МенеджерСайта, Вакансия, Реквизит);
	ИначеЕсли Сайт = Обработки.ИнтеграцияРаботаРу.Сайт() Тогда
		Результат = Обработки.ИнтеграцияРаботаРу.ЗначениеРеквизитаПубликацииПоУмолчанию(МенеджерСайта, Вакансия, Реквизит);
	ИначеЕсли Сайт = Обработки.ИнтеграцияЗарплатаРу.Сайт() Тогда
		Результат = Обработки.ИнтеграцияЗарплатаРу.ЗначениеРеквизитаПубликацииПоУмолчанию(МенеджерСайта, Вакансия, Реквизит);
	ИначеЕсли Сайт = Обработки.ИнтеграцияАвитоРабота.Сайт() Тогда
		Результат = Обработки.ИнтеграцияАвитоРабота.ЗначениеРеквизитаПубликацииПоУмолчанию(МенеджерСайта, Вакансия, Реквизит);
	ИначеЕсли Сайт = Обработки.ИнтеграцияХабрКарьера.Сайт() Тогда
		Результат = Обработки.ИнтеграцияХабрКарьера.ЗначениеРеквизитаПубликацииПоУмолчанию(МенеджерСайта, Вакансия, Реквизит);
	Иначе
		РекрутинговыеСайтыВнутреннийПереопределяемый.ПриОпределенииЗначенияРеквизитаПубликацииПоУмолчанию(
			Результат, Сайт, МенеджерСайта, Вакансия, Реквизит);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьДеревоВакансии(Сайт, МенеджерСайта, Вакансия, Дерево, СтруктураВакансииССайта) Экспорт
	
	Если Сайт = Обработки.ИнтеграцияHeadHunter.Сайт() Тогда
		Обработки.ИнтеграцияHeadHunter.ЗаполнитьДеревоВакансии(МенеджерСайта, Вакансия, Дерево, СтруктураВакансииССайта);
	ИначеЕсли Сайт = Обработки.ИнтеграцияSuperJob.Сайт() Тогда
		Обработки.ИнтеграцияSuperJob.ЗаполнитьДеревоВакансии(МенеджерСайта, Вакансия, Дерево, СтруктураВакансииССайта);
	ИначеЕсли Сайт = Обработки.ИнтеграцияРаботаРу.Сайт() Тогда
		Обработки.ИнтеграцияРаботаРу.ЗаполнитьДеревоВакансии(МенеджерСайта, Вакансия, Дерево, СтруктураВакансииССайта);
	ИначеЕсли Сайт = Обработки.ИнтеграцияЗарплатаРу.Сайт() Тогда
		Обработки.ИнтеграцияЗарплатаРу.ЗаполнитьДеревоВакансии(МенеджерСайта, Вакансия, Дерево, СтруктураВакансииССайта);
	ИначеЕсли Сайт = Обработки.ИнтеграцияАвитоРабота.Сайт() Тогда
		Обработки.ИнтеграцияАвитоРабота.ЗаполнитьДеревоВакансии(МенеджерСайта, Вакансия, Дерево, СтруктураВакансииССайта);
	ИначеЕсли Сайт = Обработки.ИнтеграцияХабрКарьера.Сайт() Тогда
		Обработки.ИнтеграцияХабрКарьера.ЗаполнитьДеревоВакансии(МенеджерСайта, Вакансия, Дерево, СтруктураВакансииССайта);
	Иначе
		РекрутинговыеСайтыВнутреннийПереопределяемый.ПриЗаполненииДереваВакансии(
			Сайт, МенеджерСайта, Вакансия, Дерево, СтруктураВакансииССайта);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьОтклики(Сайт, МенеджерСайта, Вакансия) Экспорт
	
	Если Сайт = Обработки.ИнтеграцияHeadHunter.Сайт() Тогда
		Обработки.ИнтеграцияHeadHunter.ПолучитьОтклики(МенеджерСайта, Вакансия);
	ИначеЕсли Сайт = Обработки.ИнтеграцияSuperJob.Сайт() Тогда
		Обработки.ИнтеграцияSuperJob.ПолучитьОтклики(МенеджерСайта, Вакансия);
	ИначеЕсли Сайт = Обработки.ИнтеграцияРаботаРу.Сайт() Тогда
		Обработки.ИнтеграцияРаботаРу.ПолучитьОтклики(МенеджерСайта, Вакансия);
	ИначеЕсли Сайт = Обработки.ИнтеграцияЗарплатаРу.Сайт() Тогда
		Обработки.ИнтеграцияЗарплатаРу.ПолучитьОтклики(МенеджерСайта, Вакансия);
	ИначеЕсли Сайт = Обработки.ИнтеграцияАвитоРабота.Сайт() Тогда
		Обработки.ИнтеграцияАвитоРабота.ПолучитьОтклики(МенеджерСайта, Вакансия);
	ИначеЕсли Сайт = Обработки.ИнтеграцияХабрКарьера.Сайт() Тогда
		Обработки.ИнтеграцияХабрКарьера.ПолучитьОтклики(МенеджерСайта, Вакансия);
	Иначе
		РекрутинговыеСайтыВнутреннийПереопределяемый.ПриПолученииОткликов(Сайт, МенеджерСайта, Вакансия);
	КонецЕсли;
	
КонецПроцедуры

Функция СвойстваПубликацииВакансииНаСайте(Сайт, МенеджерСайта, ИдентификаторВакансии) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыеСвойстваПубликацииВакансии();
	
	Если Сайт = Обработки.ИнтеграцияHeadHunter.Сайт() Тогда
		Результат = Обработки.ИнтеграцияHeadHunter.СвойстваПубликацииВакансииНаСайте(МенеджерСайта, ИдентификаторВакансии);
	ИначеЕсли Сайт = Обработки.ИнтеграцияSuperJob.Сайт() Тогда
		Результат = Обработки.ИнтеграцияSuperJob.СвойстваПубликацииВакансииНаСайте(МенеджерСайта, ИдентификаторВакансии);
	ИначеЕсли Сайт = Обработки.ИнтеграцияРаботаРу.Сайт() Тогда
		Результат = Обработки.ИнтеграцияРаботаРу.СвойстваПубликацииВакансииНаСайте(МенеджерСайта, ИдентификаторВакансии);
	ИначеЕсли Сайт = Обработки.ИнтеграцияЗарплатаРу.Сайт() Тогда
		Результат = Обработки.ИнтеграцияЗарплатаРу.СвойстваПубликацииВакансииНаСайте(МенеджерСайта, ИдентификаторВакансии);
	ИначеЕсли Сайт = Обработки.ИнтеграцияАвитоРабота.Сайт() Тогда
		Результат = Обработки.ИнтеграцияАвитоРабота.СвойстваПубликацииВакансииНаСайте(МенеджерСайта, ИдентификаторВакансии);
	ИначеЕсли Сайт = Обработки.ИнтеграцияХабрКарьера.Сайт() Тогда
		Результат = Обработки.ИнтеграцияХабрКарьера.СвойстваПубликацииВакансииНаСайте(МенеджерСайта, ИдентификаторВакансии);
	Иначе
		РекрутинговыеСайтыВнутреннийПереопределяемый.ПриОпределенииСвойствПубликацииВакансииНаСайте(
			Результат, Сайт, МенеджерСайта, ИдентификаторВакансии);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВидыПолей(Сайт, МенеджерСайта, ОбновлениеПубликации) Экспорт
	
	ВидыПолей = РекрутинговыеСайтыСлужебный.НовыеВидыПолей();
	
	Если Сайт = Обработки.ИнтеграцияHeadHunter.Сайт() Тогда
		ВидыПолей = Обработки.ИнтеграцияHeadHunter.ВидыПолей(МенеджерСайта, ОбновлениеПубликации);
	ИначеЕсли Сайт = Обработки.ИнтеграцияSuperJob.Сайт() Тогда
		ВидыПолей = Обработки.ИнтеграцияSuperJob.ВидыПолей(МенеджерСайта, ОбновлениеПубликации);
	ИначеЕсли Сайт = Обработки.ИнтеграцияРаботаРу.Сайт() Тогда
		ВидыПолей = Обработки.ИнтеграцияРаботаРу.ВидыПолей(МенеджерСайта, ОбновлениеПубликации);
	ИначеЕсли Сайт = Обработки.ИнтеграцияЗарплатаРу.Сайт() Тогда
		ВидыПолей = Обработки.ИнтеграцияЗарплатаРу.ВидыПолей(МенеджерСайта, ОбновлениеПубликации);
	ИначеЕсли Сайт = Обработки.ИнтеграцияАвитоРабота.Сайт() Тогда
		ВидыПолей = Обработки.ИнтеграцияАвитоРабота.ВидыПолей(МенеджерСайта, ОбновлениеПубликации);
	ИначеЕсли Сайт = Обработки.ИнтеграцияХабрКарьера.Сайт() Тогда
		ВидыПолей = Обработки.ИнтеграцияАвитоРабота.ВидыПолей(МенеджерСайта, ОбновлениеПубликации);
	Иначе
		РекрутинговыеСайтыВнутреннийПереопределяемый.ПриОпределенииВидовПолей(
			ВидыПолей, Сайт, МенеджерСайта, ОбновлениеПубликации);
	КонецЕсли;
	
	Возврат ВидыПолей;
	
КонецФункции

Функция ПоляВакансии(Сайт, МенеджерСайта, ОбновлениеПубликации = Ложь, ПовторнаяПубликация = Ложь) Экспорт
	
	ПоляВакансии = Новый Массив();
	
	Если Сайт = Обработки.ИнтеграцияHeadHunter.Сайт() Тогда
		ПоляВакансии = Обработки.ИнтеграцияHeadHunter.ПоляВакансии(МенеджерСайта, ОбновлениеПубликации, ПовторнаяПубликация);
	ИначеЕсли Сайт = Обработки.ИнтеграцияSuperJob.Сайт() Тогда
		ПоляВакансии = Обработки.ИнтеграцияSuperJob.ПоляВакансии(МенеджерСайта, ОбновлениеПубликации, ПовторнаяПубликация);
	ИначеЕсли Сайт = Обработки.ИнтеграцияРаботаРу.Сайт() Тогда
		ПоляВакансии = Обработки.ИнтеграцияРаботаРу.ПоляВакансии(МенеджерСайта, ОбновлениеПубликации, ПовторнаяПубликация);
	ИначеЕсли Сайт = Обработки.ИнтеграцияЗарплатаРу.Сайт() Тогда
		ПоляВакансии = Обработки.ИнтеграцияЗарплатаРу.ПоляВакансии(МенеджерСайта, ОбновлениеПубликации, ПовторнаяПубликация);
	ИначеЕсли Сайт = Обработки.ИнтеграцияАвитоРабота.Сайт() Тогда
		ПоляВакансии = Обработки.ИнтеграцияАвитоРабота.ПоляВакансии(МенеджерСайта, ОбновлениеПубликации, ПовторнаяПубликация);
	ИначеЕсли Сайт = Обработки.ИнтеграцияХабрКарьера.Сайт() Тогда
		ПоляВакансии = Обработки.ИнтеграцияХабрКарьера.ПоляВакансии(МенеджерСайта, ОбновлениеПубликации, ПовторнаяПубликация);
	Иначе
		РекрутинговыеСайтыВнутреннийПереопределяемый.ПоляВакансии(ПоляВакансии, Сайт, МенеджерСайта, ОбновлениеПубликации);
	КонецЕсли;
	
	Возврат ПоляВакансии;
	
КонецФункции

Функция ЗагрузитьКлассификаторы(Сайт, МенеджерСайта) Экспорт
	
	Классификаторы = Неопределено;
	
	Если Сайт = Обработки.ИнтеграцияHeadHunter.Сайт() Тогда
		Классификаторы = Обработки.ИнтеграцияHeadHunter.ЗагрузитьКлассификаторы(МенеджерСайта);
	ИначеЕсли Сайт = Обработки.ИнтеграцияSuperJob.Сайт() Тогда
		Классификаторы = Обработки.ИнтеграцияSuperJob.ЗагрузитьКлассификаторы(МенеджерСайта);
	ИначеЕсли Сайт = Обработки.ИнтеграцияРаботаРу.Сайт() Тогда
		Классификаторы = Обработки.ИнтеграцияРаботаРу.ЗагрузитьКлассификаторы(МенеджерСайта);
	ИначеЕсли Сайт = Обработки.ИнтеграцияЗарплатаРу.Сайт() Тогда
		Классификаторы = Обработки.ИнтеграцияЗарплатаРу.ЗагрузитьКлассификаторы(МенеджерСайта);
	ИначеЕсли Сайт = Обработки.ИнтеграцияАвитоРабота.Сайт() Тогда
		Классификаторы = Обработки.ИнтеграцияАвитоРабота.ЗагрузитьКлассификаторы(МенеджерСайта);
	ИначеЕсли Сайт = Обработки.ИнтеграцияХабрКарьера.Сайт() Тогда
		Классификаторы = Обработки.ИнтеграцияХабрКарьера.ЗагрузитьКлассификаторы(МенеджерСайта);
	Иначе
		РекрутинговыеСайтыВнутреннийПереопределяемый.ПриЗагрузкеКлассификаторов(Классификаторы, Сайт, МенеджерСайта);
	КонецЕсли;
	
	Возврат Классификаторы;
	
КонецФункции

Функция ОпубликоватьВакансию(Сайт, МенеджерСайта, Дерево) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	
	Если Сайт = Обработки.ИнтеграцияHeadHunter.Сайт() Тогда
		Результат = Обработки.ИнтеграцияHeadHunter.ОпубликоватьВакансию(МенеджерСайта, Дерево);
	ИначеЕсли Сайт = Обработки.ИнтеграцияSuperJob.Сайт() Тогда
		Результат = Обработки.ИнтеграцияSuperJob.ОпубликоватьВакансию(МенеджерСайта, Дерево);
	ИначеЕсли Сайт = Обработки.ИнтеграцияРаботаРу.Сайт() Тогда
		Результат = Обработки.ИнтеграцияРаботаРу.ОпубликоватьВакансию(МенеджерСайта, Дерево);
	ИначеЕсли Сайт = Обработки.ИнтеграцияЗарплатаРу.Сайт() Тогда
		Результат = Обработки.ИнтеграцияЗарплатаРу.ОпубликоватьВакансию(МенеджерСайта, Дерево);
	ИначеЕсли Сайт = Обработки.ИнтеграцияАвитоРабота.Сайт() Тогда
		Результат = Обработки.ИнтеграцияАвитоРабота.ОпубликоватьВакансию(МенеджерСайта, Дерево);
	ИначеЕсли Сайт = Обработки.ИнтеграцияХабрКарьера.Сайт() Тогда
		Результат = Обработки.ИнтеграцияХабрКарьера.ОпубликоватьВакансию(МенеджерСайта, Дерево);
	Иначе
		РекрутинговыеСайтыВнутреннийПереопределяемый.ПриПубликацииВакансии(Результат, Сайт, МенеджерСайта, Дерево);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПрименитьТарифКВакансии(Сайт, МенеджерСайта, Идентификатор, Тариф) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	
	Если Сайт = Обработки.ИнтеграцияРаботаРу.Сайт() Тогда
		Результат = Обработки.ИнтеграцияРаботаРу.ПрименитьТарифКВакансии(МенеджерСайта, Идентификатор, Тариф);
	Иначе
		РекрутинговыеСайтыВнутреннийПереопределяемый.ПриПримененииТарифаКВакансии(
			Результат, Сайт, МенеджерСайта, Идентификатор, Тариф);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция АдресВакансии(Сайт, МенеджерСайта, ИдентификаторВакансии) Экспорт
	
	АдресВакансии = "";
	
	Если Сайт = Обработки.ИнтеграцияHeadHunter.Сайт() Тогда
		АдресВакансии = Обработки.ИнтеграцияHeadHunter.АдресВакансии(МенеджерСайта, ИдентификаторВакансии);
	ИначеЕсли Сайт = Обработки.ИнтеграцияSuperJob.Сайт() Тогда
		АдресВакансии = Обработки.ИнтеграцияSuperJob.АдресВакансии(МенеджерСайта, ИдентификаторВакансии);
	ИначеЕсли Сайт = Обработки.ИнтеграцияРаботаРу.Сайт() Тогда
		АдресВакансии = Обработки.ИнтеграцияРаботаРу.АдресВакансии(МенеджерСайта, ИдентификаторВакансии);
	ИначеЕсли Сайт = Обработки.ИнтеграцияЗарплатаРу.Сайт() Тогда
		АдресВакансии = Обработки.ИнтеграцияЗарплатаРу.АдресВакансии(МенеджерСайта, ИдентификаторВакансии);
	ИначеЕсли Сайт = Обработки.ИнтеграцияАвитоРабота.Сайт() Тогда
		АдресВакансии = Обработки.ИнтеграцияАвитоРабота.АдресВакансии(МенеджерСайта, ИдентификаторВакансии);
	ИначеЕсли Сайт = Обработки.ИнтеграцияХабрКарьера.Сайт() Тогда
		АдресВакансии = Обработки.ИнтеграцияХабрКарьера.АдресВакансии(МенеджерСайта, ИдентификаторВакансии);
	Иначе
		РекрутинговыеСайтыВнутреннийПереопределяемый.ПриОпределенииАдресаВакансии(
			АдресВакансии, Сайт, МенеджерСайта, ИдентификаторВакансии);
	КонецЕсли;
	
	Возврат АдресВакансии;
	
КонецФункции

Функция ОбновитьПубликациюВакансии(Сайт, МенеджерСайта, Дерево, ИдентификаторВакансии) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	
	Если Сайт = Обработки.ИнтеграцияHeadHunter.Сайт() Тогда
		Результат = Обработки.ИнтеграцияHeadHunter.ОбновитьПубликациюВакансии(МенеджерСайта, Дерево, ИдентификаторВакансии);
	ИначеЕсли Сайт = Обработки.ИнтеграцияSuperJob.Сайт() Тогда
		Результат = Обработки.ИнтеграцияSuperJob.ОбновитьПубликациюВакансии(МенеджерСайта, Дерево, ИдентификаторВакансии);
	ИначеЕсли Сайт = Обработки.ИнтеграцияРаботаРу.Сайт() Тогда
		Результат = Обработки.ИнтеграцияРаботаРу.ОбновитьПубликациюВакансии(МенеджерСайта, Дерево, ИдентификаторВакансии);
	ИначеЕсли Сайт = Обработки.ИнтеграцияЗарплатаРу.Сайт() Тогда
		Результат = Обработки.ИнтеграцияЗарплатаРу.ОбновитьПубликациюВакансии(МенеджерСайта, Дерево, ИдентификаторВакансии);
	ИначеЕсли Сайт = Обработки.ИнтеграцияАвитоРабота.Сайт() Тогда
		Результат = Обработки.ИнтеграцияАвитоРабота.ОбновитьПубликациюВакансии(МенеджерСайта, Дерево, ИдентификаторВакансии);
	ИначеЕсли Сайт = Обработки.ИнтеграцияХабрКарьера.Сайт() Тогда
		Результат = Обработки.ИнтеграцияХабрКарьера.ОбновитьПубликациюВакансии(МенеджерСайта, Дерево, ИдентификаторВакансии);
	Иначе
		РекрутинговыеСайтыВнутреннийПереопределяемый.ПриОбновленииПубликацииВакансии(
			Результат, Сайт, МенеджерСайта, Дерево, ИдентификаторВакансии);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СнятьПубликациюВакансии(Сайт, МенеджерСайта, ИдентификаторВакансии) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	
	Если Сайт = Обработки.ИнтеграцияHeadHunter.Сайт() Тогда
		Результат = Обработки.ИнтеграцияHeadHunter.СнятьПубликациюВакансии(МенеджерСайта, ИдентификаторВакансии);
	ИначеЕсли Сайт = Обработки.ИнтеграцияSuperJob.Сайт() Тогда
		Результат = Обработки.ИнтеграцияSuperJob.СнятьПубликациюВакансии(МенеджерСайта, ИдентификаторВакансии);
	ИначеЕсли Сайт = Обработки.ИнтеграцияРаботаРу.Сайт() Тогда
		Результат = Обработки.ИнтеграцияРаботаРу.СнятьПубликациюВакансии(МенеджерСайта, ИдентификаторВакансии);
	ИначеЕсли Сайт = Обработки.ИнтеграцияЗарплатаРу.Сайт() Тогда
		Результат = Обработки.ИнтеграцияЗарплатаРу.СнятьПубликациюВакансии(МенеджерСайта, ИдентификаторВакансии);
	ИначеЕсли Сайт = Обработки.ИнтеграцияАвитоРабота.Сайт() Тогда
		Результат = Обработки.ИнтеграцияАвитоРабота.СнятьПубликациюВакансии(МенеджерСайта, ИдентификаторВакансии);
	ИначеЕсли Сайт = Обработки.ИнтеграцияХабрКарьера.Сайт() Тогда
		Результат = Обработки.ИнтеграцияХабрКарьера.СнятьПубликациюВакансии(МенеджерСайта, ИдентификаторВакансии);
	Иначе
		РекрутинговыеСайтыВнутреннийПереопределяемый.ПриСнятииВакансииСПубликации(
			Результат, Сайт, МенеджерСайта, ИдентификаторВакансии);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭлементКлассификатора(Сайт, МенеджерСайта, ИмяСписка, Значение) Экспорт
	
	ЭлементКлассификатора = Неопределено;
	
	Если Сайт = Обработки.ИнтеграцияHeadHunter.Сайт() Тогда
		ЭлементКлассификатора = Обработки.ИнтеграцияHeadHunter.ЭлементКлассификатора(МенеджерСайта, ИмяСписка, Значение);
	ИначеЕсли Сайт = Обработки.ИнтеграцияSuperJob.Сайт() Тогда
		ЭлементКлассификатора = Обработки.ИнтеграцияSuperJob.ЭлементКлассификатора(МенеджерСайта, ИмяСписка, Значение);
	ИначеЕсли Сайт = Обработки.ИнтеграцияРаботаРу.Сайт() Тогда
		ЭлементКлассификатора = Обработки.ИнтеграцияРаботаРу.ЭлементКлассификатора(МенеджерСайта, ИмяСписка, Значение);
	ИначеЕсли Сайт = Обработки.ИнтеграцияЗарплатаРу.Сайт() Тогда
		ЭлементКлассификатора = Обработки.ИнтеграцияЗарплатаРу.ЭлементКлассификатора(МенеджерСайта, ИмяСписка, Значение);
	ИначеЕсли Сайт = Обработки.ИнтеграцияАвитоРабота.Сайт() Тогда
		ЭлементКлассификатора = Обработки.ИнтеграцияАвитоРабота.ЭлементКлассификатора(МенеджерСайта, ИмяСписка, Значение);
	ИначеЕсли Сайт = Обработки.ИнтеграцияХабрКарьера.Сайт() Тогда
		ЭлементКлассификатора = Обработки.ИнтеграцияХабрКарьера.ЭлементКлассификатора(МенеджерСайта, ИмяСписка, Значение);
	Иначе
		РекрутинговыеСайтыВнутреннийПереопределяемый.ПриОпределенииЭлементаКлассификатора(
			ЭлементКлассификатора, Сайт, МенеджерСайта, ИмяСписка, Значение);
	КонецЕсли;
	
	Возврат ЭлементКлассификатора;
	
КонецФункции

Функция СписокВыбораПоКлассификатору(Сайт, МенеджерСайта, Путь) Экспорт
	
	СписокВыбора = Новый СписокЗначений();
	
	Если Сайт = Обработки.ИнтеграцияHeadHunter.Сайт() Тогда
		СписокВыбора = Обработки.ИнтеграцияHeadHunter.СписокВыбораПоКлассификатору(МенеджерСайта, Путь);
	ИначеЕсли Сайт = Обработки.ИнтеграцияSuperJob.Сайт() Тогда
		СписокВыбора = Обработки.ИнтеграцияSuperJob.СписокВыбораПоКлассификатору(МенеджерСайта, Путь);
	ИначеЕсли Сайт = Обработки.ИнтеграцияРаботаРу.Сайт() Тогда
		СписокВыбора = Обработки.ИнтеграцияРаботаРу.СписокВыбораПоКлассификатору(МенеджерСайта, Путь);
	ИначеЕсли Сайт = Обработки.ИнтеграцияЗарплатаРу.Сайт() Тогда
		СписокВыбора = Обработки.ИнтеграцияЗарплатаРу.СписокВыбораПоКлассификатору(МенеджерСайта, Путь);
	ИначеЕсли Сайт = Обработки.ИнтеграцияАвитоРабота.Сайт() Тогда
		СписокВыбора = Обработки.ИнтеграцияАвитоРабота.СписокВыбораПоКлассификатору(МенеджерСайта, Путь);
	ИначеЕсли Сайт = Обработки.ИнтеграцияХабрКарьера.Сайт() Тогда
		СписокВыбора = Обработки.ИнтеграцияХабрКарьера.СписокВыбораПоКлассификатору(МенеджерСайта, Путь);
	Иначе
		РекрутинговыеСайтыВнутреннийПереопределяемый.ПриФормированииСпискаВыбораПоКлассификатору(
			СписокВыбора, Сайт, МенеджерСайта, Путь);
	КонецЕсли;
	
	Возврат СписокВыбора;
	
КонецФункции

Функция ЗаполнитьДеревоКлассификатора(Сайт, МенеджерСайта, Классификатор, Дерево) Экспорт
	
	Результат = Ложь;
	
	Если Сайт = Обработки.ИнтеграцияHeadHunter.Сайт() Тогда
		Результат = Обработки.ИнтеграцияHeadHunter.ЗаполнитьДеревоКлассификатора(МенеджерСайта, Классификатор, Дерево);
	ИначеЕсли Сайт = Обработки.ИнтеграцияSuperJob.Сайт() Тогда
		Результат = Обработки.ИнтеграцияSuperJob.ЗаполнитьДеревоКлассификатора(МенеджерСайта, Классификатор, Дерево);
	ИначеЕсли Сайт = Обработки.ИнтеграцияРаботаРу.Сайт() Тогда
		Результат = Обработки.ИнтеграцияРаботаРу.ЗаполнитьДеревоКлассификатора(МенеджерСайта, Классификатор, Дерево);
	ИначеЕсли Сайт = Обработки.ИнтеграцияЗарплатаРу.Сайт() Тогда
		Результат = Обработки.ИнтеграцияЗарплатаРу.ЗаполнитьДеревоКлассификатора(МенеджерСайта, Классификатор, Дерево);
	ИначеЕсли Сайт = Обработки.ИнтеграцияАвитоРабота.Сайт() Тогда
		Результат = Обработки.ИнтеграцияАвитоРабота.ЗаполнитьДеревоКлассификатора(МенеджерСайта, Классификатор, Дерево);
	ИначеЕсли Сайт = Обработки.ИнтеграцияХабрКарьера.Сайт() Тогда
		Результат = Обработки.ИнтеграцияХабрКарьера.ЗаполнитьДеревоКлассификатора(МенеджерСайта, Классификатор, Дерево);
	Иначе
		РекрутинговыеСайтыВнутреннийПереопределяемый.ПриЗаполненииДереваКлассификатора(
			Результат, Сайт, МенеджерСайта, Классификатор, Дерево);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УточнитьОписаниеОшибки(Сайт, МенеджерСайта, КодСостояния, ОписаниеОшибки) Экспорт
	
	УточненноеОписаниеОшибки = "";
	
	Если Сайт = Обработки.ИнтеграцияHeadHunter.Сайт() Тогда
		УточненноеОписаниеОшибки = Обработки.ИнтеграцияHeadHunter.УточнитьОписаниеОшибки(МенеджерСайта, КодСостояния, ОписаниеОшибки);
	ИначеЕсли Сайт = Обработки.ИнтеграцияЗарплатаРу.Сайт()Тогда
		УточненноеОписаниеОшибки = Обработки.ИнтеграцияЗарплатаРу.УточнитьОписаниеОшибки(МенеджерСайта, КодСостояния, ОписаниеОшибки);
	ИначеЕсли Сайт = Обработки.ИнтеграцияSuperJob.Сайт() Тогда
		УточненноеОписаниеОшибки = Обработки.ИнтеграцияSuperJob.УточнитьОписаниеОшибки(МенеджерСайта, КодСостояния, ОписаниеОшибки);
	ИначеЕсли Сайт = Обработки.ИнтеграцияРаботаРу.Сайт() Тогда
		УточненноеОписаниеОшибки = Обработки.ИнтеграцияРаботаРу.УточнитьОписаниеОшибки(МенеджерСайта, КодСостояния, ОписаниеОшибки);
	ИначеЕсли Сайт = Обработки.ИнтеграцияАвитоРабота.Сайт() Тогда
		УточненноеОписаниеОшибки = Обработки.ИнтеграцияАвитоРабота.УточнитьОписаниеОшибки(МенеджерСайта, КодСостояния, ОписаниеОшибки);
	Иначе
		РекрутинговыеСайтыВнутреннийПереопределяемый.ПриУточненииОписанияОшибки(
			УточненноеОписаниеОшибки, Сайт, МенеджерСайта, КодСостояния, ОписаниеОшибки);
	КонецЕсли;
	
	Возврат УточненноеОписаниеОшибки;
	
КонецФункции

#КонецОбласти

#Область УсловныеМетоды

Процедура НайтиКандидатов(Сайт, МенеджерСайта, ТаблицаНайденныхКандидатов, СтруктураОтбора, ПараметрыПоиска) Экспорт
	
	Если Сайт = Обработки.ИнтеграцияHeadHunter.Сайт() Тогда
		Обработки.ИнтеграцияHeadHunter.НайтиКандидатов(
			МенеджерСайта, ТаблицаНайденныхКандидатов, СтруктураОтбора, ПараметрыПоиска);
	ИначеЕсли Сайт = Обработки.ИнтеграцияSuperJob.Сайт() Тогда
		Обработки.ИнтеграцияSuperJob.НайтиКандидатов(
			МенеджерСайта, ТаблицаНайденныхКандидатов, СтруктураОтбора, ПараметрыПоиска);
	ИначеЕсли Сайт = Обработки.ИнтеграцияРаботаРу.Сайт() Тогда
		Обработки.ИнтеграцияРаботаРу.НайтиКандидатов(
			МенеджерСайта, ТаблицаНайденныхКандидатов, СтруктураОтбора, ПараметрыПоиска);
	ИначеЕсли Сайт = Обработки.ИнтеграцияЗарплатаРу.Сайт() Тогда
		Обработки.ИнтеграцияЗарплатаРу.НайтиКандидатов(
			МенеджерСайта, ТаблицаНайденныхКандидатов, СтруктураОтбора, ПараметрыПоиска);
	ИначеЕсли Сайт = Обработки.ИнтеграцияАвитоРабота.Сайт() Тогда
		Обработки.ИнтеграцияАвитоРабота.НайтиКандидатов(
			МенеджерСайта, ТаблицаНайденныхКандидатов, СтруктураОтбора, ПараметрыПоиска);
	Иначе
		РекрутинговыеСайтыВнутреннийПереопределяемый.ПриПоискеКандидатов(
			Сайт, МенеджерСайта, ТаблицаНайденныхКандидатов, СтруктураОтбора, ПараметрыПоиска);
	КонецЕсли;
	
КонецПроцедуры

Функция ИдентификаторРезюмеПоАдресу(Сайт, МенеджерСайта, Знач АдресРезюме) Экспорт
	
	Результат = Неопределено;
	
	Если Сайт = Обработки.ИнтеграцияHeadHunter.Сайт() Тогда
		Результат = Обработки.ИнтеграцияHeadHunter.ИдентификаторРезюмеПоАдресу(МенеджерСайта, АдресРезюме);
	ИначеЕсли Сайт = Обработки.ИнтеграцияSuperJob.Сайт() Тогда
		Результат = Обработки.ИнтеграцияSuperJob.ИдентификаторРезюмеПоАдресу(МенеджерСайта, АдресРезюме);
	ИначеЕсли Сайт = Обработки.ИнтеграцияРаботаРу.Сайт() Тогда
		Результат = Обработки.ИнтеграцияРаботаРу.ИдентификаторРезюмеПоАдресу(МенеджерСайта, АдресРезюме);
	ИначеЕсли Сайт = Обработки.ИнтеграцияЗарплатаРу.Сайт() Тогда
		Результат = Обработки.ИнтеграцияЗарплатаРу.ИдентификаторРезюмеПоАдресу(МенеджерСайта, АдресРезюме);
	ИначеЕсли Сайт = Обработки.ИнтеграцияАвитоРабота.Сайт() Тогда
		Результат = Обработки.ИнтеграцияАвитоРабота.ИдентификаторРезюмеПоАдресу(МенеджерСайта, АдресРезюме);
	ИначеЕсли Сайт = Обработки.ИнтеграцияХабрКарьера.Сайт() Тогда
		Результат = Обработки.ИнтеграцияХабрКарьера.ИдентификаторРезюмеПоАдресу(МенеджерСайта, АдресРезюме);
	Иначе
		РекрутинговыеСайтыВнутреннийПереопределяемый.ПриОпределенииИдентификатораРезюмеПоАдресу(
			Результат, Сайт, МенеджерСайта, АдресРезюме);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ДанныеКандидатаПоРезюмеССайта(Сайт, МенеджерСайта, ИдентификаторРезюме) Экспорт
	
	ДанныеКандидата = Справочники.Кандидаты.СтруктураДанныхКандидата();
	
	Если Сайт = Обработки.ИнтеграцияHeadHunter.Сайт() Тогда
		ДанныеКандидата = 
			Обработки.ИнтеграцияHeadHunter.ДанныеКандидатаПоРезюмеССайта(МенеджерСайта, ИдентификаторРезюме);
	ИначеЕсли Сайт = Обработки.ИнтеграцияSuperJob.Сайт() Тогда
		ДанныеКандидата = 
			Обработки.ИнтеграцияSuperJob.ДанныеКандидатаПоРезюмеССайта(МенеджерСайта, ИдентификаторРезюме);
	ИначеЕсли Сайт = Обработки.ИнтеграцияРаботаРу.Сайт() Тогда
		ДанныеКандидата = 
			Обработки.ИнтеграцияРаботаРу.ДанныеКандидатаПоРезюмеССайта(МенеджерСайта, ИдентификаторРезюме);
	ИначеЕсли Сайт = Обработки.ИнтеграцияЗарплатаРу.Сайт() Тогда
		ДанныеКандидата = 
			Обработки.ИнтеграцияЗарплатаРу.ДанныеКандидатаПоРезюмеССайта(МенеджерСайта, ИдентификаторРезюме);
	ИначеЕсли Сайт = Обработки.ИнтеграцияАвитоРабота.Сайт() Тогда
		ДанныеКандидата = 
			Обработки.ИнтеграцияАвитоРабота.ДанныеКандидатаПоРезюмеССайта(МенеджерСайта, ИдентификаторРезюме);
	ИначеЕсли Сайт = Обработки.ИнтеграцияХабрКарьера.Сайт() Тогда
		ДанныеКандидата = 
			Обработки.ИнтеграцияХабрКарьера.ДанныеКандидатаПоРезюмеССайта(МенеджерСайта, ИдентификаторРезюме);
	Иначе
		РекрутинговыеСайтыВнутреннийПереопределяемый.ПриПолученииДанныхКандидатаПоРезюмеССайта(
			ДанныеКандидата, Сайт, МенеджерСайта, ИдентификаторРезюме);
	КонецЕсли;
	
	Возврат ДанныеКандидата;

КонецФункции

Функция ПовторноОпубликоватьВакансию(Сайт, МенеджерСайта, Дерево, Вакансия, ИдентификаторВакансии) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	
	Если Сайт = Обработки.ИнтеграцияSuperJob.Сайт() Тогда
		Результат = Обработки.ИнтеграцияSuperJob.ПовторноОпубликоватьВакансию(МенеджерСайта, Дерево, Вакансия, ИдентификаторВакансии);
	ИначеЕсли Сайт = Обработки.ИнтеграцияРаботаРу.Сайт() Тогда
		Результат = Обработки.ИнтеграцияРаботаРу.ПовторноОпубликоватьВакансию(МенеджерСайта, Дерево, Вакансия, ИдентификаторВакансии);
	ИначеЕсли Сайт = Обработки.ИнтеграцияАвитоРабота.Сайт() Тогда
		Результат = Обработки.ИнтеграцияАвитоРабота.ПовторноОпубликоватьВакансию(МенеджерСайта, Дерево, Вакансия, ИдентификаторВакансии);
	ИначеЕсли Сайт = Обработки.ИнтеграцияХабрКарьера.Сайт() Тогда
		Результат = Обработки.ИнтеграцияХабрКарьера.ПовторноОпубликоватьВакансию(МенеджерСайта, Дерево, Вакансия, ИдентификаторВакансии);
	Иначе
		РекрутинговыеСайтыВнутреннийПереопределяемый.ПриПовторнойПубликацииВакансии(
			Результат, Сайт, МенеджерСайта, Дерево, Вакансия, ИдентификаторВакансии);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПоискДоступен(Сайт, МенеджерСайта) Экспорт
	
	Результат = Неопределено;
	
	Если Сайт = Обработки.ИнтеграцияHeadHunter.Сайт() Тогда
		Результат = Обработки.ИнтеграцияHeadHunter.ПоискДоступен(МенеджерСайта);
	ИначеЕсли Сайт = Обработки.ИнтеграцияЗарплатаРу.Сайт() Тогда
		Результат = Обработки.ИнтеграцияЗарплатаРу.ПоискДоступен(МенеджерСайта);
	Иначе
		РекрутинговыеСайтыВнутреннийПереопределяемый.ПриОпределенииДоступностиПоиска(Результат, Сайт, МенеджерСайта);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КонтактыРезюме(Сайт, МенеджерСайта, АдресРезюме) Экспорт
	
	КонтактыРезюме = РекрутинговыеСайтыСлужебный.НовыеКонтактыРезюме();
	
	Если Сайт = Обработки.ИнтеграцияHeadHunter.Сайт() Тогда
		КонтактыРезюме = Обработки.ИнтеграцияHeadHunter.КонтактыРезюме(МенеджерСайта, АдресРезюме);
	ИначеЕсли Сайт = Обработки.ИнтеграцияSuperJob.Сайт() Тогда
		КонтактыРезюме = Обработки.ИнтеграцияSuperJob.КонтактыРезюме(МенеджерСайта, АдресРезюме);
	ИначеЕсли Сайт = Обработки.ИнтеграцияЗарплатаРу.Сайт() Тогда
		КонтактыРезюме = Обработки.ИнтеграцияЗарплатаРу.КонтактыРезюме(МенеджерСайта, АдресРезюме);
	ИначеЕсли Сайт = Обработки.ИнтеграцияАвитоРабота.Сайт() Тогда
		КонтактыРезюме = Обработки.ИнтеграцияАвитоРабота.КонтактыРезюме(МенеджерСайта, АдресРезюме);
	Иначе
		РекрутинговыеСайтыВнутреннийПереопределяемый.ПриПолученииКонтактовРезюме(
			КонтактыРезюме, Сайт, МенеджерСайта, АдресРезюме);
	КонецЕсли;
	
	Возврат КонтактыРезюме;
	
КонецФункции

Функция ДоступныеДляПолученияКонтакты(Сайт, МенеджерСайта, АдресРезюме) Экспорт
	
	ДоступностьКонтактов = ПодборПерсоналаКлиентСервер.ДоступностьКонтактовВРезюме();
	
	Если Сайт = Обработки.ИнтеграцияHeadHunter.Сайт() Тогда
		ДоступностьКонтактов = Обработки.ИнтеграцияHeadHunter.ДоступныеДляПолученияКонтакты(МенеджерСайта, АдресРезюме);
	ИначеЕсли Сайт = Обработки.ИнтеграцияSuperJob.Сайт() Тогда
		ДоступностьКонтактов = Обработки.ИнтеграцияSuperJob.ДоступныеДляПолученияКонтакты(МенеджерСайта, АдресРезюме);
	ИначеЕсли Сайт = Обработки.ИнтеграцияРаботаРу.Сайт() Тогда
		ДоступностьКонтактов = Обработки.ИнтеграцияРаботаРу.ДоступныеДляПолученияКонтакты(МенеджерСайта, АдресРезюме);
	ИначеЕсли Сайт = Обработки.ИнтеграцияЗарплатаРу.Сайт() Тогда
		ДоступностьКонтактов = Обработки.ИнтеграцияЗарплатаРу.ДоступныеДляПолученияКонтакты(МенеджерСайта, АдресРезюме);
	ИначеЕсли Сайт = Обработки.ИнтеграцияАвитоРабота.Сайт() Тогда
		ДоступностьКонтактов = Обработки.ИнтеграцияАвитоРабота.ДоступныеДляПолученияКонтакты(МенеджерСайта, АдресРезюме);
	ИначеЕсли Сайт = Обработки.ИнтеграцияХабрКарьера.Сайт() Тогда
		ДоступностьКонтактов = Обработки.ИнтеграцияХабрКарьера.ДоступныеДляПолученияКонтакты(МенеджерСайта, АдресРезюме);
	Иначе
		РекрутинговыеСайтыВнутреннийПереопределяемый.ПриОпределенииДоступныхДляПолученияКонтакты(
			ДоступностьКонтактов, Сайт, МенеджерСайта, АдресРезюме);
	КонецЕсли;
	
	Возврат ДоступностьКонтактов;
	
КонецФункции

Процедура ЗагрузитьКомментарииКандидата(Сайт, МенеджерСайта, Кандидат, ДанныеРезюме) Экспорт
	
	Если Сайт = Обработки.ИнтеграцияHeadHunter.Сайт() Тогда
		Обработки.ИнтеграцияHeadHunter.ЗагрузитьКомментарииКандидата(МенеджерСайта, Кандидат, ДанныеРезюме);
	ИначеЕсли Сайт = Обработки.ИнтеграцияSuperJob.Сайт() Тогда
		Обработки.ИнтеграцияSuperJob.ЗагрузитьКомментарииКандидата(МенеджерСайта, Кандидат, ДанныеРезюме);
	ИначеЕсли Сайт = Обработки.ИнтеграцияРаботаРу.Сайт() Тогда
		Обработки.ИнтеграцияРаботаРу.ЗагрузитьКомментарииКандидата(МенеджерСайта, Кандидат, ДанныеРезюме);
	ИначеЕсли Сайт = Обработки.ИнтеграцияЗарплатаРу.Сайт() Тогда
		Обработки.ИнтеграцияЗарплатаРу.ЗагрузитьКомментарииКандидата(МенеджерСайта, Кандидат, ДанныеРезюме);
	Иначе
		РекрутинговыеСайтыВнутреннийПереопределяемый.ПриЗагрузкеКомментариевКандидата(
			Сайт, МенеджерСайта, Кандидат, ДанныеРезюме);
	КонецЕсли;
	
КонецПроцедуры

Функция ИнформацияОПользователе(Сайт, МенеджерСайта) Экспорт
	
	Результат = Неопределено;
	
	Если Сайт = Обработки.ИнтеграцияHeadHunter.Сайт() Тогда
		Результат = Обработки.ИнтеграцияHeadHunter.ИнформацияОПользователе(МенеджерСайта);
	ИначеЕсли Сайт = Обработки.ИнтеграцияSuperJob.Сайт() Тогда
		Результат = Обработки.ИнтеграцияSuperJob.ИнформацияОПользователе(МенеджерСайта);
	ИначеЕсли Сайт = Обработки.ИнтеграцияЗарплатаРу.Сайт() Тогда
		Результат = Обработки.ИнтеграцияЗарплатаРу.ИнформацияОПользователе(МенеджерСайта);
	Иначе
		РекрутинговыеСайтыВнутреннийПереопределяемый.ПриПолученииИнформацииОПользователе(Результат, Сайт, МенеджерСайта);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти
